ch2/ch2-problems.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-09-16 Mon 02:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chapter 2 problems</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="pedh" />
<link rel="stylesheet" type="text/css" href="/css/org-info.css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/CLRS-Solutions"> UP </a>
 |
 <a accesskey="H" href="/CLRS-Solutions"> HOME </a>
</div><div id="content">
<h1 class="title">Chapter 2 problems</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org51f601e">ch2-problems</a>
<ul>
<li><a href="#org6f32efb">2-1</a></li>
<li><a href="#org8436739">2-2</a></li>
<li><a href="#org2316f3b">2-3</a></li>
<li><a href="#org1df7376">2-4</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org51f601e" class="outline-2">
<h2 id="org51f601e">ch2-problems</h2>
<div class="outline-text-2" id="text-org51f601e">
</div>
<div id="outline-container-org6f32efb" class="outline-3">
<h3 id="org6f32efb">2-1</h3>
<div class="outline-text-3" id="text-org6f32efb">
<ul class="org-ul">
<li><p>
<b>a.</b>
</p>

<p>
The worst-case running time is
</p>
\begin{align*}
T(n,k)&=n/k\times\Theta(k^2)\\
      &=\Theta(nk)
\end{align*}</li>
<li><p>
<b>b.</b>
</p>

<pre class="example">
MERGE-SUBLISTS(S)
    let S'[1..S.length // 2] to be new array
    for i = 1 to S.length // 2
	S'[i] = MERGE(S[2 * i - 1], S[2 * i])
    if S.length % 2 != 0
	S'.append(S[S.length])
    return MERGE-SUBLIST(S')
</pre></li>

<li><p>
<b>c.</b>
</p>

<p>
\(k = \Theta(\lg{n})\)
</p></li>

<li><p>
<b>d.</b>
</p>

<p>
In practice, k should be the largest value that insertion sort is faster
than merge sort.
</p></li>
</ul>
</div>
</div>
<div id="outline-container-org8436739" class="outline-3">
<h3 id="org8436739">2-2</h3>
<div class="outline-text-3" id="text-org8436739">
<ul class="org-ul">
<li><p>
<b>a.</b>
</p>

<p>
We need to prove A' is a permutation of A.
</p></li>

<li><p>
<b>b.</b>
</p>

<p>
<b>Loop Invariant:</b> A[j] is the smallest value of A[j..n], and A[j..n] is a
permutation of the original A[j..n].
</p>

<p>
<b>Initialization:</b> A[j..n] is empty.
</p>

<p>
<b>Maintenance:</b> After each iteration, A[j - 1] becomes the smallest value of
A[j - 1..n], and A[j - 1..n] is a permutation of the original A[j - 1..n].
</p>

<p>
<b>Termination:</b> A[i] is the smallest value of A[i..n], and A[i..n] is a
permutation of the original A[i..n].
</p></li>

<li><p>
<b>c.</b>
</p>

<p>
<b>Loop Invariant:</b> At the start of each iteration of the outer loop, the
subarray A[1..i - 1] is sorted and contains the smallest (i - 1) elements.
And A remains to be a permutation of the original A.
</p>

<p>
<b>Initialization:</b> At the start of first iteration, the subarray A[1..i - 1]
is empty, and A is the original A.
</p>

<p>
<b>Maintenance:</b> At the end of each iteration, the element A[i] is the
smallest of A[i..n], and we are using exchange to move the elements, so A
is a permutation of the original A.
</p>

<p>
<b>Termination:</b> The iteration terminates when i = n - 1, this means
A[1..n - 1] is sorted and contains the smallest (n - 1) elements, and A is
a permutation of the original A, so A[n] is the largest element of A, A is
correctly sorted.
</p></li>
<li><p>
<b>d.</b>
</p>

<p>
The running time of bubblesort is
</p>
\begin{align*}
T(n)&=\sum_{i=1}^{n-1}(n-i)\Theta(1)\\
    &=\frac{n(n-1)}{2}\Theta(1)\\
    &=\Theta(n^2)
\end{align*}

<p>
Bubblesort in any cases has the same running time as the insertion sort in
worst case.
</p></li>
</ul>
</div>
</div>
<div id="outline-container-org2316f3b" class="outline-3">
<h3 id="org2316f3b">2-3</h3>
<div class="outline-text-3" id="text-org2316f3b">
<ul class="org-ul">
<li><p>
<b>a.</b>
</p>

<p>
\(\Theta(n)\)
</p></li>

<li><p>
<b>b.</b>
</p>
<pre class="example">
NAIVE-POLYNOMIAL-EVALUATION(A, x)
    y = 0
    for i = 1 to A.length
	y = y + A[i] * POWER(x, i - 1)
    return y
</pre>

<p>
The running time is \(\Theta(n^2)\), if POWER has \(\Theta(n)\) running
time.
</p></li>
<li><p>
<b>c.</b>
</p>

<p>
<b>Initialization:</b> i = n, and y = 0
</p>

<p>
<b>Maintenance:</b> After the ith iteration,
</p>
\begin{align*}
y&=a_i+x\sum_{k=0}^{n-(i+1)}a_{k+i+1}x^k\\
 &=a_ix^0+\sum_{k=1}^{n-i}a_{k+i}x^k\\
 &=\sum_{k=0}^{n-i}a_{k+i}x^k
\end{align*}

<p>
<b>Termination:</b> The loop terminates when i = -1,
</p>
\begin{align*}
y&=\sum_{k=0}^{n-(-1+1)}a_{k-1+1}x^k\\
 &=\sum_{k=0}^{n}a_kx^k
\end{align*}</li>
<li><b>d.</b>
The loop invariant shows that the given code fragment correctly evaluates
the polynomial.</li>
</ul>
</div>
</div>
<div id="outline-container-org1df7376" class="outline-3">
<h3 id="org1df7376">2-4</h3>
<div class="outline-text-3" id="text-org1df7376">
<ul class="org-ul">
<li><p>
<b>a.</b>
</p>

<p>
(1, 5), (2, 5), (3, 4), (3, 5), (4, 5)
</p></li>
<li><p>
<b>b.</b>
</p>

<p>
The array in non-increase order [n, n - 1, &#x2026;, 2, 1] has the most
inversions. The number of inversions is
\(\binom{n}{2} = \frac{n(n-1)}{2}\).
</p></li>
<li><p>
<b>c.</b>
</p>

<p>
The running time is in proportion to the number of inversions in the
input array.
</p>

<p>
Consider the (i - 1)th iteration of the outer loop in the insertion sort,
the subarray A[1..i - 1] is a sorted permutation of the original
A[1..i - 1]. Each iteration of the inner loop reduces the number of
inversions by a pair (A[j], A[i]). The total number of iterations of the
inner loop is in conclusion the same as the number of inversions.
</p></li>
<li><p>
<b>d.</b>
</p>

<pre class="example">
MERGE-SORT(A, p, r)
    inv = 0
    if p &lt; r
	q = (p + r) // 2
	inv = inv + MERGE-SORT(A, p, q)
	inv = inv + MERGE-SORT(A, q + 1, r)
	inv = inv + MERGE(A, p, q, r)
    return inv
</pre>
<pre class="example">
MERGE(A, p, q, r)
    n1 = q - p + 1
    n2 = r - q
    let L[1..n1 + 1] and R[1..n2 + 1] be new arrays
    for i = 1 to n1
	L[i] = A[p + i - 1]
    for j = 1 to n2
	R[j] = A[q + j]
    L[n1 + 1] = \infty
    R[n2 + 1] = \infty
    i = 1
    j = 1
    inv = 0
    for k = p to r
	if L[i] &lt;= R[j]
	    A[k] = L[i]
	    i = i + 1
	else A[k] = R[j]
	     inv = inv + n1 + 1 - i
	     j = j + 1
    return inv
</pre></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: pedh</p>
<p class="date">Created: 2019-09-16 Mon 02:33</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
